/* Flubber Panel: Label on the button to cancel the subscription to the newsletter */
"Cancel" = "Cancelar";
/* Flubber Panel: Placeholder text for the email field */
"Email Address" = "Dirección de email";
/* Flubber Panel: Message for the alert to subscribe to the newsletter */
"Enter your email address to subscribe to our mailing list." = "Escribe tu dirección de email para suscribirte a la lista de correo.";
/* Flubber Panel: Label for section with social links */
"Follow us" = "Síguenos";
/* Flubber Panel: Label on button to dismiss the \"no connection\" alert
   Flubber Panel: Label on the button to dismiss the alert displayed when the signup fails */
"OK" = "OK";
/* Flubber Panel: Label for section with other apps */
"Our Apps" = "Nuestras apps";
/* Flubber Panel: Label on the button to subscribe to the newsletter
   Flubber Panel: Title for the alert to subscribe to the newsletter */
"Subscribe" = "Suscribirse";
/* Flubber Panel: Title for the alert displayed when the signup fails */
"Subscription Failed" = "Error en la suscripción";
/* Flubber Panel: Message for the alert displayed when the signup fails */
"We couldn't subscribe you to the list. Please check your email address and try again." = "No te hemos suscrito a la lista. Por favor, comprueba la dirección de email e inténtalo de nuevo.";
/* Flubber Panel: Message when user taps on an App but is not connected to Internet */
"You need an Internet connection to download this App" = "Para descargar esta app es necesaria una conexión a Internet";